export const gamesShowTime = {
  2801: '00:00:00-23:59:59;',
  2802: '07:05:00-23:55:00;',
  2803: '夏令时:不固定，20:00-次日19:00;非夏令时:不固定，21:00-次日20:00;',
  2804: '夏令时:18:30-次日14:30;非夏令时:19:30-次日17:30;',
  2901: '夏令时:不固定，20:00-次日19:00;非夏令时:不固定，21:00-次日20:00;',
  2902: '13:08:45-次日04:03:45;',
  2903: '大约2-3天一期，开始时间为开奖日21:30往后',
  2904: '夏令时:全天不间断，前一日21:29算做开始第一期;非夏令时:全天不间断，前一日22:29算做开始第一期;',
  2905: '夏令时:全天不间断，前一日21:29算做开始第一期;非夏令时:全天不间断，前一日22:29算做开始第一期;',
  3102: '00:00:00-23:59:59;',
  3202: '冬令时北京时间12:00:00~次⽇06:50:00;夏令时北京时间11:00:00~次⽇05:50:00;',
};

export const pc28 = [2801, 2802, 2803, 2804];

export const shengXiao = [
  '鼠',
  '牛',
  '虎',
  '兔',
  '龙',
  '蛇',
  '马',
  '羊',
  '猴',
  '鸡',
  '狗',
  '猪',
];

export const teXiaoNum = [
  [1, 13, 25, 37, 49],
  [2, 14, 26, 38],
  [3, 15, 27, 39],
  [4, 16, 28, 40],
  [5, 17, 29, 41],
  [6, 18, 30, 42],
  [7, 19, 31, 43],
  [8, 20, 32, 44],
  [9, 21, 33, 45],
  [10, 22, 34, 46],
  [11, 23, 35, 47],
  [12, 24, 36, 48],
];

// teXiaoNum.slice(0, cur+1).reverse().concat(teXiaoNum.slice(cur+1).reverse());
